# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'caskroom/drivers'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'mosh'
brew 'rsync'
brew 'storm'
brew 'wget'
cask 'transmission'
mas 'ForkLift', id: 412448059
mas 'IP Scanner', id: 404167149

# Terminal
brew 'autojump'
brew 'joe'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'

# Améliorations d'interface et usage
# cask 'bartender'
cask 'coconutbattery'
cask 'itsycal'
mas 'Amphetamine', id: 937984704
mas 'AutoMute', id: 1118136179
mas 'Magnet', id: 417375580

# Utilitaires divers
cask 'appcleaner'
cask 'daisydisk'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'keka'
cask 'authy'
cask 'flux'
mas '1Password', id: 443987910
mas 'Simple Recorder', id: 989175722

# Web
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'git'
brew 'node'
brew 'pkg-config'
brew 'ruby'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
# https://github.com/ryanoasis/nerd-fonts#option-4-homebrew-fonts
cask 'font-hack-nerd-font'
cask 'ghostlab'
cask 'sourcetree'
cask 'meld'
cask 'reflector'
cask 'sequel-pro'
cask 'tableplus'
cask 'docker'
cask 'visual-studio-code'
cask 'postman'
cask 'browserstacklocal'
cask 'integrity'
#mas 'Xcode', id: 497799835

# Images
brew 'graphicsmagick'
brew 'gsl'
brew 'imagemagick@6'
cask 'imageoptim'

# Vidéos
brew 'ffmpeg'
cask 'molotov'
cask 'subsmarine'
cask 'vlc'

# Musique
cask 'deezer'

# Photo
cask 'adobe-creative-cloud'

# Divertissement
cask 'steam'

# Communication
# cask 'colloquy'
cask 'zoomus'
mas 'Slack', id: 803453959

# Bureautique
cask 'libreoffice'
# cask 'typora'
mas 'Reeder 3', id: 880001334
